In [1]:
import numpy as np
import pandas as pd

In [5]:
dict1={
    "name":['Wajahat','Saad','Mubashir'],
    "age":[12,43,31],
    "city":['Karachi','Lahore','Islamabad']
}

In [6]:
df=pd.DataFrame(dict1) # will convert dictionary to excel table form // 1 excel sheet ha jis ko python ma use krskty ha 
#(DATA Frame)

In [7]:
df

       name  age       city
0   Wajahat   12    Karachi
1      Saad   43     Lahore
2  Mubashir   31  Islamabad

In [8]:
df.to_csv('friends.csv') # covert data to excel sheet

In [11]:
df.to_csv('friends_if.csv',index=False) # will give no index in excel file

In [12]:
df.head(2) # if data is very large in million/ billion records then head will give first 2 rows

      name  age     city
0  Wajahat   12  Karachi
1     Saad   43   Lahore

In [14]:
df.tail(1) # if data is very large in million/ billion records then head will give last 2 rows

       name  age       city
2  Mubashir   31  Islamabad

In [15]:
df.describe() # will give statistical value of numeric values in data

             age
count   3.000000
mean   28.666667
std    15.631165
min    12.000000
25%    21.500000
50%    31.000000
75%    37.000000
max    43.000000

In [17]:
waji=pd.read_csv('waji.csv')

In [18]:
waji

   Train No  Speed       City
0     20202   1200    Karachi
1     23212   3400     Lahore
2     34342   2300  Islamabad

In [19]:
waji['Speed'][0]=1500

<ipython-input-19-f2de86435f5c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  waji['Speed'][0]=1500

In [20]:
waji

   Train No  Speed       City
0     20202   1500    Karachi
1     23212   3400     Lahore
2     34342   2300  Islamabad

In [21]:
waji.to_csv('waji.csv')

In [22]:
waji.index=[1,2,3] # can change index

In [23]:
waji

   Train No  Speed       City
1     20202   1500    Karachi
2     23212   3400     Lahore
3     34342   2300  Islamabad

***There are two types of data structure in Pandas . Onw is Series and other is DataFrame. ***
Series => One dimensional array with index it stores single column or row of data with data frame like df['C2']
DataFrame => Tabular spreadsheet like structure representing rows each of which containing one or more columns***

In [29]:
ser=pd.Series(np.random.rand(10))

In [30]:
ser

0    0.723900
1    0.715056
2    0.890023
3    0.712204
4    0.965563
5    0.250174
6    0.106760
7    0.896463
8    0.541898
9    0.732234
dtype: float64

In [31]:
type(ser)

pandas.core.series.Series

In [33]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [34]:
newdf

            0         1         2         3         4
0    0.863400  0.345350  0.525814  0.941810  0.821039
1    0.917983  0.491833  0.208696  0.089156  0.227050
2    0.076448  0.526238  0.680619  0.014374  0.127923
3    0.952317  0.844848  0.271314  0.125899  0.175539
4    0.256107  0.630687  0.125566  0.985714  0.791961
..        ...       ...       ...       ...       ...
329  0.675514  0.567345  0.692334  0.593270  0.362388
330  0.111736  0.154859  0.626273  0.349719  0.561195
331  0.088128  0.373012  0.514513  0.436965  0.098029
332  0.250511  0.853208  0.099045  0.818305  0.013671
333  0.576427  0.618192  0.208525  0.368841  0.533411

[334 rows x 5 columns]

In [ ]:
newdf.